const depositAmount = prompt("Введіть суму вкладу:"); // сума вкладу
const interestRate = 0.05; // процентна ставка депозиту 5% річних
const months = 2; // термін вкладу в місяцях

const interestAmount = depositAmount * interestRate * (months / 12); // розраховуємо нараховані відсотки
// Формула: сума нарахованих відсотків = сума вкладу * процентна ставка * (термін вкладу в місяцях / 12)

alert(`На ваш вклад нараховано ${interestAmount.toFixed(2)} грн. відсотків.`); // виводимо результат


//Вираз 2 && 0 && 3 поверне 0, оскільки всі значення у цьому логічному виразі є істинними (truthy),
// а оператор && повертає останнє значення, яке перевірялося та повернуло false (або 0, NaN, null, undefined, '').
//
// Вираз 2 || 0 || 3 поверне 2, оскільки перше значення у цьому логічному виразі є істинним (truthy),
// а оператор || повертає перше істинне значення у послідовності перевірок.
//
// Вираз 2 && 0 || 3 поверне 3, оскільки спочатку виконається операція 2 && 0, яка поверне 0,
// а потім виконається операція 0 || 3, яка поверне перше істинне значення у послідовності перевірок (тут це 3).